error_25=Cannot remove lock from user : {0}
error_325=Object class does not exist!
error_330=Object name is not defined!
error_1070=This is a composite error ! It contains more exceptions in...
error_1195=Object not found!
error_4085=User does not exist!
error_4270=You are not allowed to modify object owner
error_4275=You don't have any role in that project!
error_5225=All links are not updated : {0}!
error_6070=Can not find unique file template!
error_6075=Can not find file template!
error_6080=Can not delete object used in CAD sessions!
error_6085=Can not manage CAD Parameters for non CAD User!
error_6110=You have to define relationship with type DOC or DOCBOM!
error_6115=You have to define relationship with type DOC or DOCBOM but not with both!
error_6120=Wrong generic file on recognition!
error_8100=Error while executing script (before replication export)
error_8105=Error while executing script (after replication export)
error_8110=Error while executing script (before replication import)
error_8115=Error while executing script (after replication import)
error_8120=Error while executing script (before CAD structure browsing)
error_13010=No filter passed!
error_13020=Error parsing Excel file!
error_13025=There are some missing categories!
error_16010=Computer cannot be moved as its vaults contain {0} files.
error_16015=Some aliases are already existing on that site :{0}!
error_16020=Cannot find computer {0}!
error_16025=You must select a server from site:{0}!
error_16030=Some aliases are already existing on that server :{0}!
error_16035=You must select a vault from site :{0}!
error_16040=Cannot find alias {0} for site {1}!
error_16045=Computer name can not be empty!
error_16050=Computer name already exists!
error_16055=Cannot delete that computer : There are files stored in its vaults!
error_16060=Vault already exists!
error_16063=Vault directory can not be empty! 
error_16065=Can not delete vault - there are stored files!
error_16070=Alias can not be empty! 
error_16075=Alias already exists!
error_16080=Cannot delete that alias : Already in use by {0} files!
error_16085=Alias association already done for that site !
error_16090=Cannot dissociate alias : Already in use by files!
error_16095=Menu already exists: {0} !
error_16097=Name or application can not be empty!
error_20010=You are not owner of that view!
error_335=Unable to change status for these {0} object(s) !\n{1}
error__335=Unable to change status for these {0} object(s) !\n{1}

error_5220=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para modificar este v\u00EDnculo ({0}--{1})
error_22050=Operation cancelled : Object {0} {1}.{2} ({3}) can not be locked!

error_0=System error
error_1180=Impossible. Object is used in CAD :
error_8205=Error while executing script (on lock)
error_8210=Erro ao executar script (antes da cria\u00E7\u00E3o do v\u00EDnculo)
error_8230=Erro ao executar script (depois de criar v\u00EDnculo)
error_8250=Erro ao executar script (antes de atualizar v\u00EDnculo)
error_8270=Erro ao executar script (depois de atualizar v\u00EDnculo)
error_8290=Erro ao executar script (antes de suprimit v\u00EDnculo)
error_8310=Erro ao executar script (depois de suprimir v\u00EDnculo)
error_21010=Can not create Version on locked object !
error_21015=Can not create Release on locked object !
error_21020=Can not create Version on object belonging to another site !
error_21025=Can not create Release on object belonging to another site !
error_21030=Impossible. Object is part of an active engineering change order !
error_4280=You don't have any valid role (audros.flowboard.manager.role key) !
error_15010=Empty date of application
error_1075=SQL error :
error_4285=You are not allowed to apply this order !
error_8052=Error while executing script (before attachment opening)
# REPLICATION
error_14010=File type not supported on destination site!
error_14020=Can not create link (object miss)!
error_14025=There is a difference between languages defined in source and dest. sites!
error_14030=Error zipping attachments!
error_14035=Error unzipping attachments!
error_14037=No replication settings!
error_14040=No root folder setting!
error_14045=Cannot create folder!
error_14050=Different uniqueness!
error_14055=Different attachment possibility!
error_14060=Different initial release!
error_14065=Different initial version!
error_14070=Different initial status!
error_14075=No attribute found!
error_14080=Different attribute type!
error_14085=Attribute lenght not propper!
error_14090=File type is not supported!
error_14095=No data to import!

# CAD 
error_22010=Can not copy object that is linked with 'Instance' relationship!
error_22015=Can not create version when instances are involved!
error_22020=Can not create release when instances are involved!
error_22025=Can not change object class : New class is not appropriate for existing links!
error_22030=Can not change class between classes that have different cad type!
error_22035=Can not delete object that is used in CAD by : {0}!
error_22040=Can not substitute object when instances are involved!
error_22045=Can not substitute object with classes that have different cad types!
error_22055=Cannot create version : This is a CAD object and you are not a CAD user!
error_22060=Cannot create release : This is a CAD object and you are not a CAD user!
error_22065=Cannot create version : Drawing contains multiple views on several models (DRW_VERSION=2) : {0}!
error_22070=Cannot create release : Drawing contains multiple views on several models (DRW_VERSION=2) : {0}!
error_22075=Can not substitute object when dependencies or family tables are involved. Do it in you CAD system!
error_22080=Can not substitute CAD object by a non CAD object !
error_22085=Can not substitute CAD object : Error during generic identification!
error_22090=Can not substitute two instances if they do not have the same generic! 
error_22095=Can not substitute object : It should involve files of only ONE CAD system!
error_22100=Can not substitute object : It should involve files with same CAD type!
error_22105=Can not substitute object : It should involve files with same alias!

error_20=Cannot unlock! Locker {0} doesn''t exist!
error_11040=Can not delete CAD file that has CAD use case!
error_11050=Cannot replace CAD file !
error_4102=You are not allowed to rename object
error_4105=You are not allowed to change object class
error_4225=You are not allowed to lock object
error_4227=You are not allowed to lock object (script) !
error_4040=LDAP authentication failed
error_6090=Forbidden action !
error_6095=Object has been modified in @udros since last transfer!
error_6100=No root object sent!
error_6105=This model is not managed by the specified CAD Application!
error_23010=Can not delete object whose start date is set!
error_23015=No active version for that Master object !
error_23020=Selection is not applicable to this date : {0}!

error_1220=Object is from another site !
error_1225=Parent object is from another site !
error_1230=Child object is from another site !

error_3020=Imposs\u00EDvel de pegar um \u00FAnico casal vers\u00E3o-revis\u00E3o
error_8030=Erro ao executar script (antes do renome do objeto)
error_5110=Imposs\u00EDvel de criar este v\u00EDnculo, pois iria provocar um la\u00E7o infinito
error__2020=O n\u00FAmero m\u00E1ximo de sess\u00F5es simult\u00E2neas foi alcan\u00E7ado
error_5070=Voc\u00EA n\u00E3o possui permiss\u00E3o para criar este v\u00EDnculo
error_7000=O arquivo de licen\u00E7as n\u00E3o foi encontrado
error_4240=Voc\u00EA n\u00E3o possui permiss\u00E3o para adicionar um arquivo
error_9055=Erro ao ler o pr\u00F3ximo identificador
error_1120=Erro ao validar a transa\u00E7\u00E3o
error_9050=Erro ao executar SQL
error_12010=Erro ao criar arquivo
error_5300=Erro de sintaxe SQL
error__510=Informa\u00E7\u00F5es das licen\u00E7as n\u00E3o foram encontradas
error_8025=Erro ao executar script (depois de substituir objeto)
error_3010=A a\u00E7\u00E3o fracassou
error_8020=Erro ao executar script (antes de substituir objeto)
error_5100=Imposs\u00EDvel de criar este v\u00EDnculo. Viola\u00E7\u00E3o do n\u00FAmero m\u00E1ximo de v\u00EDnculos entre estes dois objetos
error__2010=A licen\u00E7a tempor\u00E1ria expirou
error_9=Problema de unicidade
error_8=Imposs\u00EDvel de comparar as vers\u00F5es 
error_7=Erro ao atualizar\:
error_6={0} {1}.{2} ({3}) Objeto j\u00E1 bloqueado por\: {4}
error_5060=Imposs\u00EDvel de criar este v\u00EDnculo. Associa\u00E7\u00E3o inexistente
error_5=O objeto n\u00E3o existe
error_4=Esta refer\u00EAncia n\u00E3o \u00E9 \u00FAnica
error_3=EJB em constru\u00E7\u00E3o
error_4230=Voc\u00EA n\u00E3o possui permiss\u00E3o para visualizar este arquivo
error_2=Erro ao atualizar a base de dados
error_1=Erro do tipo EJB
error_15=Imposs\u00EDvel de identificar o objeto
error_9045=Erro ao ler resultado da demanda
error_14=Imposs\u00EDvel de achar arm\u00E1rio associado a esta extens\u00E3o\:
error_13=Nome do posto cliente inexistente
error_12=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para retirar bloqueio colocado por\: {0}
error_4030=O usu\u00E1rio n\u00E3o est\u00E1 conectado
error_11=Permiss\u00E3o recusada
error_1110=Erro ao fechar conex\u00E3o
error_10=Erro ao atualizar objeto
error_9040=Erro ao ler estrutura de usu\u00E1rio
error_4190=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para suprimir este v\u00EDnculo
error__500=Arquivo de licen\u00E7as n\u00E3o foi encontrado
error_8014=Erro ao executar script (altera\u00E7\u00E3o de status)
error__8014=Erro ao executar script (altera\u00E7\u00E3o de status)
error_8012=Erro ao executar script (depois da c\u00F3pia do objeto)
error_8011=Erro ao executar script (antes da c\u00F3pia do objeto)
error_8010=Erro ao executar script (depois da cria\u00E7\u00E3o da vers\u00E3o)
error_9235=Erro ao anular transa\u00E7\u00E3o
error_5050=Imposs\u00EDvel criar este v\u00EDnculo. O pai est\u00E1 bloqueado por\:
error_4220=Erro ao criar componente usu\u00E1rio
error_9230=Erro ao validar a transa\u00E7\u00E3o
error_9035=Erro ao ler estrutura do sistema
error_4020=Conex\u00E3o recusada
error_1100=Erro ao estabelecer conex\u00E3o
error_9030=Erro ao criar v\u00EDnculo
error_4180=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para criar este v\u00EDnculo
4180_NO_PERM=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para criar este v\u00EDnculo
error_8009=Erro ao executar script (antes de criar vers\u00E3o)
error_8008=Erro ao executar script (depois de criar revis\u00E3o)
error_8007=Erro ao executar script (antes de criar revis\u00E3o)
error_8006=Erro ao executar script (depois de suprimir o objeto)
error_8005=Erro ao executar script (antes de suprimir objeto)
error_8004=Erro ao executar script (depois de atualizar objeto)
error_8003=Erro ao executar script (antes de atualizar objeto)
error_8002=Erro ao executar script (depois de criar objeto)
error_1060=Erro ao pesquisar interface distante EJB
error_8001=Erro ao executar script (antes de criar objeto)
error_4215=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para comparar as estruturas
error_9225=Imposs\u00EDvel de gerir esta conex\u00E3o 
error_4212=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para modificar hist\u00F3rico
error_4210=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para trocar seu status
error_9220=Imposs\u00EDvel de utilizar uma conex\u00E3o fechada
error_9025=Erro ao criar revis\u00E3o
error_4010=A autentifica\u00E7\u00E3o fracassou
error_9020=Erro ao criar vers\u00E3o
error_4170=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para modificar este v\u00EDnculo
error_6065=Conflito de vers\u00F5es
error_1050=Erro de supress\u00E3o
error_6060=Erro ao pesquisar visualisa\u00E7\u00E3o CAD para uma classe
error_9415=Erro ao salvar resultado da a\u00E7\u00E3o
error_9410=Erro ao inicializar par\u00E2metro
error_9215=Erro ao ler uma conex\u00E3o separada
error_4200=Imposs\u00EDvel de identificar v\u00EDnculo
error_9210=Erro ao abrir uma nova conex\u00E3o
error_9015=Par\u00E2metros inv\u00E1lidos
error_9010=Erro ao criar objeto
error_4160=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para modificar o ordenamento
error_1040=Erro de entrada
error_6050=Nenhum objeto CAD encontrado
error_4155=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para suprimir este objeto
error_4150=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para criar este objeto
error_1030=Erro de tipo
error_6040=Este objeto n\u00E3o \u00E9 do tipo CAD
error_1190=Imposs\u00EDvel\! Este objeto possui filhos fora do padr\u00E3o
error_5210=Imposs\u00EDvel de modificar este v\u00EDnculo. O pai est\u00E1 bloqueado por\:
error_320=O atributo -libelle_variante- est\u00E1 faltando nesta classe de v\u00EDnculos (gest\u00E3o de tradu\u00E7\u00F5es)
error_5370=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para copiar esta estrutura
error_4140=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para criar uma revis\u00E3o
error_1185=Imposs\u00EDvel\! Objetos foram criados neste projeto. Voc\u00EA deve antes padroniz\u00E1-los
error_315=Os atributos deste v\u00EDnculo n\u00E3o existem
error_1020=Erro ao ler arquivo
error_6030=Nome de arquivo inv\u00E1lido
error_310=O v\u00EDnculo n\u00E3o existe
error_5360=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para substituir este objeto
error_7050=Arquivo de licen\u00E7as inv\u00E1lido
error_4130=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para modificar sua revis\u00E3o
error_10010=Erro de leitura, na tabela CONCORD\u00C2NCIA, da chave\:
error_1175=Imposs\u00EDvel\! O objeto est\u00E1 apontado por um outro objeto
error_305=Os atributos deste objeto n\u00E3o existem
error_1010=Erro de conex\u00E3o baixa de dados
error_6020=Nome de par\u00E2metro inv\u00E1lido
error_1170=O objeto \u00E9 utilizado em um formul\u00E1rio DOCSTAR
error_8075=Erro ao executar script (depois de suprimir arquivo)
error_11035=Identificador de arquivo inv\u00E1lido (n\u00E3o \u00E9 igual ao identificador de objeto)
error_100=Imposs\u00EDvel de bloquear um objeto pertencente a um outro lugar\:
error_8070=Erro ao executar script (antes de suprimir arquivo)
error_7040=O n\u00FAmero m\u00E1ximo de sess\u00F5es simult\u00E2neas foi alcan\u00E7ado
error_4120=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para criar uma vers\u00E3o
error_1000=Erro EJB
error_6010=Erro ao ler o par\u00E2metro
error_4080=Combina\u00E7\u00E3o usu\u00E1rio/senha inv\u00E1lida
error_1160=Imposs\u00EDvel\! O objeto ainda est\u00E1 sendo utilizado dentro de uma estrutura
error_8065=Erro ao executar script (depois de atualizar arquivo)
error_8060=Erro ao executar script (antes de atualizar arquivo)
error_11020=O arm\u00E1rio n\u00E3o p\u00F4de ser identificado
error_2020=Os par\u00E2metros inv\u00E1lidos foram passados \u00E0 JSP
error_4273=Voc\u00EA n\u00E3o possui autorizas\u00E3o para padronizar este objeto\:
error_7030=A licen\u00E7a tempor\u00E1ria expirou
error_4110=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para modificar sua vers\u00E3o 
error_4075=Nenhum usu\u00E1rio foi especificado
error_4070=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para desconectar usu\u00E1rios
error_1150=Erro ao preparar demanda. 
error_8055=Erro ao executar script (depois de adicionar arquivo)
error_8050=Erro ao executar script (antes de adicionar arquivo)
error_11010=O arquivo n\u00E3o foi duplicado
error_4265=O objeto n\u00E3o pertence ao seu site
error_7020=M\u00F3dulo n\u00E3o encontrado
error_5090=Imposs\u00EDvel de criar este v\u00EDnculo. Viola\u00E7\u00E3o do n\u00FAmero m\u00E1ximo filhos
error_4100=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para modificar este objeto
error_4260=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para modificar este arquivo
error__1010=M\u00F3dulo n\u00E3o encontrado
error_4065=Erro ao conectar
error_9075=Erro ao suprimir objeto
error_4060=A fonte de dados n\u00E3o existe
error_9070=Erro ao carregar status
error_1140=Erro ao definir conex\u00E3o 
error_5320=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para suprimir este v\u00EDnculo
error_8045=Erro ao executar script (depois de mudar classe)
error_8040=Erro ao executar script (antes de mudar classe)
error__2030=Arquivo de licen\u00E7as inv\u00E1lido
error_7010=Informa\u00E7\u00F5es das licen\u00E7as n\u00E3o foram encontradas
error_5080=Imposs\u00EDvel de criar v\u00EDnculo. Viola\u00E7\u00E3o do n\u00FAmero m\u00E1ximo de pais
error_4250=Voc\u00EA n\u00E3o possui autoriza\u00E7\u00E3o para suprimir um arquivo
error_9065=Erro ao carregar revis\u00E3o
error_5315=Imposs\u00EDvel de suprimir este v\u00EDnculo. O filho tem arquivos CAD\!
error_4050=Usu\u00E1rio j\u00E1 est\u00E1 conectado
error_9060=Erro ao carregar vers\u00E3o
error_1130=Erro ao anular transa\u00E7\u00E3o
error_5310=Imposs\u00EDvel de suprimir este v\u00EDnculo. O pai foi bloqueado por\:
error_8035=Erro ao executar script (depois de renomear objeto)
error_5115=Imposs\u00EDvel de criar este v\u00EDnculo. Os objetos podem ser vinculados somentes com objetos do mesmo projeto

#ModelShape Flex

error_543210=Invalid password
error_543211=Invalid login
error_543212=Invalid computer name
error_543213=User is already connected with the same login on the same database
error_543214=Session has expired
error_543215=The language you try to delete is used by another data
error_543216=The language you try to delete is used by another site
error_543217=The language you try to delete is the base language
error_543218=Site already exists
error_543219=Site name must be less than 32 characters
error_543220=Site name is null
error_543221=Language already exists
error_543222=Language must be less than 20 characters
error_543223=Site is associated to a user
error_543224=Site is associated to a computer
error_543225=Object class name already exists
error_543226=Object class name must be less than 14 characters
error_543227=Object class name is null
error_543228=Relationship class name already exists
error_543229=Relationship class name must be less than 14 characters
error_543230=Relationship class name is null
error_543231=Links exist through this relationship, it can not be deleted
error_543232=Error while saving data:
error_543233=Error occurred during operation:
error_5380=Private thread

syst_attr_obj_name=Identifier
syst_attr_sys_relationship=Rel.
syst_attr_str_qty=Qty
syst_attr_str_flag=Flag
syst_attr_sys_desktop=Fav.
syst_attr_sys_attachments=Att.
syst_attr_sys_locker=Lock
syst_attr_sys_last_version=L.V.
syst_attr_sys_class=Class
syst_attr_obj_version=Ver.
syst_attr_obj_release=Rel.
syst_attr_obj_description=Description
syst_attr_obj_modificationdate=Modified on
syst_attr_obj_modifier=Modifier
syst_attr_obj_status_label=Status

error__2040=You are not allowed to run modules that may update Audros data 
